Revit 2024 API
SpecTypeId.LinearMomentScale Property
 Linear Moment Scale, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId LinearMomentScale { get; }
Visual Basic
Public Shared ReadOnly Property LinearMomentScale As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LinearMomentScale {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace